In [1]:
import pandas as pd
from pandas_search import search

In [2]:
table1 = pd.DataFrame({'Apple':[1,2,3],'Banana':[7,6,8]})
table1

   Apple  Banana
0      1       7
1      2       6
2      3       8

In [3]:
#This should return both as both have the letter a
search(table1,'a')

['Apple', 'Banana']

In [4]:
#This should return just Banana as it is the only one to have the letter b
search(table1,'b')

['Banana']

In [5]:
#Note that we can index the dataframe by this output
table1[search(table1,'b')]

   Banana
0       7
1       6
2       8

In [6]:
#This should return nothing because the b in Banana is uppercase
search(table1,'b',case=True)

[]

In [7]:
##Now let's add another column
table1['Apple_and_Banana'] = table1['Apple'] + table1['Banana']
table1

   Apple  Banana  Apple_and_Banana
0      1       7                 8
1      2       6                 8
2      3       8                11

In [8]:
search(table1,'appleandbanana',remove_us=True)

['Apple_and_Banana']